# SetSymbolTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..SetSymbolTypeId Method
FormatOptions Class See Also
---
Sets the symbol that should be displayed to indicate the unit quantifying the value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetSymbolTypeId(
	ForgeTypeId symbolTypeId
)
```

Visual Basic
---
```text
Public Sub SetSymbolTypeId ( _
	symbolTypeId As ForgeTypeId _
)
```

Visual C++
---
```text
public:
void SetSymbolTypeId(
	ForgeTypeId^ symbolTypeId
)
```

# ### Parameters
symbolTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The symbol identifier. An empty identifier string indicates no symbol.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | symbolTypeId is not a valid symbol for the unit in this FormatOptions. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
Autodesk.Revit.DB Namespace